**Project 3**

Your assignment involves combining information from a number of SQL tables, then displaying the information in a pandas DataFrame.

In [16]:
#used sqlite for this assignment & loaded packages
import  pandas as pd
import numpy as np
import sqlite3
from sqlalchemy import create_engine
from IPython.display import Image

Image(url='http://lh4.ggpht.com/_oKo6zFhdD98/SWFPtyfHJFI/AAAAAAAAAMc/GdrlzeBNsZM/s800/ChinookDatabaseSchema1.1.png')

**Create a pandas DataFrame** 

A DataFrame that displays Customers’ Last Name and First Name, and each customer’s purchased Track names and Album Titles. What the first five rows of your results should look like?

In [17]:
# Perform query: sql
sql = '''SELECT c.LastName, c.FirstName, i.InvoiceId, il.InvoiceId, t.Name, a.Title
         FROM Customer as c
         INNER JOIN Invoice as i
         ON c.CustomerId = i.CustomerId
         INNER JOIN InvoiceLine as il
         ON i.InvoiceId = il.InvoiceId
         INNER JOIN Track as t
         ON il.TrackId = t.TrackId
         INNER JOIN Album as a
         ON t.AlbumId = a.AlbumId
         ORDER BY c.LastName, c.FirstName'''

con = sqlite3.connect("C:/Users/jake/Desktop/Chinook/Chinook_Sqlite.sqlite")
pd.read_sql_query(sql , con=con).head(5)

,LastName,FirstName,InvoiceId,InvoiceId,Name,Title
0,Almeida,Roberto,34,34,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,155,155,In The Evening,In Through The Out Door
2,Almeida,Roberto,155,155,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,166,166,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,166,166,Caso Você Queira Saber,Minas

**Verifying the data**

I noticed that the database must be slightly off from the example on the assignment so i wrote another query to determine if the data that I queried was wrong.

Note I don't see Almeida ROberto when i search for Sex Machine.

In [18]:
sql = '''SELECT c.LastName, c.FirstName, i.InvoiceId, t.Name, a.Title
         FROM Customer as c
         INNER JOIN Invoice as i
         ON c.CustomerId = i.CustomerId
         INNER JOIN InvoiceLine as il
         ON i.InvoiceId = il.InvoiceId
         INNER JOIN Track as t
         ON il.TrackId = t.TrackId
         INNER JOIN Album as a
         ON t.AlbumId = a.AlbumId
         WHERE a.TItle = 'Sex Machine'
         ORDER BY c.LastName, c.FirstName'''
         
con = sqlite3.connect("C:/Users/jake/Desktop/Chinook/Chinook_Sqlite.sqlite")
pd.read_sql_query(sql , con=con)

,LastName,FirstName,InvoiceId,Name,Title
0,Kovács,Ladislav,151,Out Of Sight,Sex Machine
1,Kovács,Ladislav,151,Get Up (I Feel Like Being A) Sex Machine,Sex Machine
2,Kovács,Ladislav,151,It's Too Funky In Here,Sex Machine
3,Philips,Mark,362,"Say It Loud, I'm Black And I'm Proud Pt.1",Sex Machine
4,Philips,Mark,362,I'm Real,Sex Machine
5,Srivastava,Puja,45,Night Train,Sex Machine
6,Srivastava,Puja,45,It's A Man's Man's Man's World,Sex Machine
7,Srivastava,Puja,45,Hey America,Sex Machine
8,Srivastava,Puja,45,Get Up Offa That Thing,Sex Machine
9,Stevens,Victor,256,Papa's Got A Brand New Bag Pt.1,Sex Machine
10,Stevens,Victor,256,Hey America,Sex Machine
11,Stevens,Victor,256,Living In America,Sex Machine

**CONCLUSION**

I noticed a huge advantage with SQLalchemy and SQLite. Using these packages makes it easier to connect to databases and bypass server setups. However, I took notice at Sqlite it truly shines because it is extremely lightweight. Setting up an SQLite database is nearly instant, there is no server to set up, no users to define, and no permissions to concern yourself with. For this reason, it is often used as a developmental and protyping database, but it can and is used in production.